package hk220915;

public class Valiable7 {
	public static void main(String [] args) {
		/* 리터널 : 자연어 ( 한국어, 일본어, 영어 , 중국어,...)
		 *         문자 리터널 : '가', 'a',    '0','1',
		 *                        a(변수),  0(정수리터널)            
		 *          문자열 리터널 :"11","abcd"
		 *                    "가"(문자열 리터널)
		 *                    '가'(문자 리터널)                
		 *        자연수 :
		 *     		정수 리터널 : 10, "10"(문자열 리터널)
		 *                    
		 *          실수 리터널 : 10.5
		 *                    "10.5"(문자열 리터널)
		 */
	}
}
